# Button texts
BUTTON_ENVIRONMENT = "Среда"
BUTTON_PROFILE = "Профиль"
BUTTON_FEEDBACK = "Обратная связь"
BUTTON_ABOUT = "О боте"
BUTTON_LOGIN = "Войти"

# Messages
GREETING_MESSAGE = "Привет, {name}! Добро пожаловать на платформу студенческой взаимопомощи"

LOGIN_MESSAGE = """
Авторизация происходит через home mephi, ваши данные защищены.

Логин: -
Пароль: -

👤Введите логин:
"""

PASSWORD_MESSAGE = """
Авторизация происходит через home mephi, ваши данные защищены.

Логин: {login}
Пароль: -

🔒Введите пароль:
"""

AUTH_PROCESSING_MESSAGE = """
Авторизация происходит через home mephi, ваши данные защищены.

Логин: {login}
Пароль: {password}

🔐 Авторизация...
"""

AUTH_ERROR_MESSAGE = "Ошибка авторизации. Пожалуйста, попробуйте еще раз."

FEEDBACK_MESSAGE = """
С вопросами и идеями можно обратиться к разработчику: @seajoyer
"""

ENVIRONMENT_MESSAGE = """
Создавайте заявки на помощь по предметам и голосуйте за существующие. Ваша активность поможет старшекурсникам увидеть актуальные проблемы и оказать поддержку.

Если вы уже прошли первый курс, не стесняйтесь делиться своим опытом - ваши знания бесценны для младших товарищей!

У каждого участника есть 3 голоса - используйте их с умом!
Доступно голосов: {balance}
"""

PROFILE_MESSAGE = """
{name}
Группа: {group}

{rating} благодарностей

{requests}

{responses}
"""

# Inline button texts
OPEN_ENVIRONMENT_BUTTON = "Открыть среду"
UPDATE_PROFILE_BUTTON = "Обновить"
MY_REQUESTS_BUTTON = "Мои запросы"
MY_RESPONSES_BUTTON = "Мои отклики"
